# Importing data and libraries

In [2]:
# import libraries
import pandas as pd
import numpy as np
import os

In [3]:
path = r'C:\Users\Goce\Desktop\Achievement 4 Python Fundamentals' #Defining path

In [4]:
df_prods = pd.read_csv(os.path.join(path, 'Data', 'Prepared Data', 'products_checked.csv'), index_col = False)  # Importing products data set

In [5]:
df_orders_products_combined = pd.read_pickle(os.path.join(path, 'Data', 'Prepared Data', 'orders_products_combined.pkl'),)  # Importing orders_products_combined

# Checking the shape

In [5]:
df_prods.head()

,Unnamed: 0,product_id,product_name,aisle_id,department_id,prices
0,0,1,Chocolate Sandwich Cookies,61,19,5.8
1,1,2,All-Seasons Salt,104,13,9.3
2,2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,4,5,Green Chile Anytime Sauce,5,13,4.3

In [6]:
#Drop the unnecessary Column
df_prods = df_prods.drop(columns = ['Unnamed: 0'])

In [7]:
df_prods.head()

,product_id,product_name,aisle_id,department_id,prices
0,1,Chocolate Sandwich Cookies,61,19,5.8
1,2,All-Seasons Salt,104,13,9.3
2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,5,Green Chile Anytime Sauce,5,13,4.3

In [8]:
df_prods.shape

(49672, 5)

In [9]:
df_orders_products_combined.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_last-order,new_customer,product_id,add_to_cart_order,reordered,_merge
0,2539329,1,1,2,8,NaN,True,196,1,0,both
1,2539329,1,1,2,8,NaN,True,14084,2,0,both
2,2539329,1,1,2,8,NaN,True,12427,3,0,both
3,2539329,1,1,2,8,NaN,True,26088,4,0,both
4,2539329,1,1,2,8,NaN,True,26405,5,0,both

In [10]:
df_orders_products_combined.shape

(32434489, 11)

# Merging data

In [9]:
 #Merge df_orders_products_combined and df_prods using product_id as a key
df_merged = df_orders_products_combined.merge(df_prods, on = 'product_id', indicator = "merge_flag")

In [10]:
#Checking the newly merged dataframe
df_merged.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_last-order,new_customer,product_id,add_to_cart_order,reordered,_merge,Unnamed: 0,product_name,aisle_id,department_id,prices,merge_flag
0,2539329,1,1,2,8,NaN,True,196,1,0,both,195,Soda,77,7,9.0,both
1,2398795,1,2,3,7,15.0,False,196,1,1,both,195,Soda,77,7,9.0,both
2,473747,1,3,3,12,21.0,False,196,1,1,both,195,Soda,77,7,9.0,both
3,2254736,1,4,4,7,29.0,False,196,1,1,both,195,Soda,77,7,9.0,both
4,431534,1,5,4,15,28.0,False,196,1,1,both,195,Soda,77,7,9.0,both

In [11]:
#Checking the values in the merge_flag column
df_merged['merge_flag'].value_counts()

both          32404859
left_only            0
right_only           0
Name: merge_flag, dtype: int64

In [12]:
#Checking the merged shape
df_merged.shape

(32404859, 17)

# Exporting Data

In [13]:
df_merged.to_pickle(os.path.join(path, 'Data','Prepared Data', 'orders_products_merged.pkl'))